Revit 2027 API
AnalysisDisplayColorEntry.HasValue Method
 Check if color entry has associated value.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasValue()
Public Function HasValue As Boolean
public:
bool HasValue()
member HasValue : unit -> bool
Return Value
Boolean
 True if entry has a value associated with it, false otherwise.
See Also
Reference
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace